#language: ru

  Функционал: Вклады

    Сценарий: Заявка на вклад №1
      * Перейти в меню - Вклады
      * Страница 'Вклады' загружена
      * Нажатие на "Рубли"
      * Заполнить поле "Сумма вклада" значением "300000"
      * Выбрать период "6 месяцев"
      * Заполнить поле "Ежемесячное пополнение" значением "50000"
      * Нажатие на "Ежемесячная капитализация"

      * Проверка значения "6.75%" в поле "Ставка"
      * Проверка значения "564 398,21" в поле "К снятию"
      * Проверка значения "250 000" в поле "Пополнение"
      * Проверка значения "14 398,21" в поле "Начислено"

    Сценарий: Заявка на вклад №2
      * Перейти в меню - Вклады
      * Страница 'Вклады' загружена
      * Нажатие на "Рубли"
      * Заполнить поле "Сумма вклада" значением "500000"
      * Выбрать период "9 месяцев"
      * Заполнить поле "Ежемесячное пополнение" значением "70000"
      * Нажатие на "Ежемесячная капитализация"
      * Нажатие на "Частичное снятие"

      * Проверка значения "6.30%" в поле "Ставка"
      * Проверка значения "871 330,60" в поле "К снятию"
      * Проверка значения "350 000" в поле "Пополнение"
      * Проверка значения "21 330,60" в поле "Начислено"